{"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 144, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_cid"}, "name": "input_cid", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": false, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwCpA07pAQAAAKkB2gRh\neGlzqQLaAnRm2gd1bnN0YWNrqQHaAXipAHIKAAAA+kxDOi9Vc2Vycy9hbGV4YS9Eb2N1bWVudHMv\nU3R1ZGl1bS9TdHVkaXVtL0JhY2hlbG9yYXJiZWl0L0JBX0dBTi9sc3RtX21vZGVsLnB52gg8bGFt\nYmRhPokAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "lstm_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["input_cid", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "emb_cid", "trainable": false, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "emb_cid", "inbound_nodes": [[["lambda_5", 0, 0, {}]], [["lambda_5", 0, 1, {}]], [["lambda_5", 0, 2, {}]], [["lambda_5", 0, 3, {}]], [["lambda_5", 0, 4, {}]], [["lambda_5", 0, 5, {}]], [["lambda_5", 0, 6, {}]], [["lambda_5", 0, 7, {}]], [["lambda_5", 0, 8, {}]], [["lambda_5", 0, 9, {}]], [["lambda_5", 0, 10, {}]], [["lambda_5", 0, 11, {}]], [["lambda_5", 0, 12, {}]], [["lambda_5", 0, 13, {}]], [["lambda_5", 0, 14, {}]], [["lambda_5", 0, 15, {}]], [["lambda_5", 0, 16, {}]], [["lambda_5", 0, 17, {}]], [["lambda_5", 0, 18, {}]], [["lambda_5", 0, 19, {}]], [["lambda_5", 0, 20, {}]], [["lambda_5", 0, 21, {}]], [["lambda_5", 0, 22, {}]], [["lambda_5", 0, 23, {}]], [["lambda_5", 0, 24, {}]], [["lambda_5", 0, 25, {}]], [["lambda_5", 0, 26, {}]], [["lambda_5", 0, 27, {}]], [["lambda_5", 0, 28, {}]], [["lambda_5", 0, 29, {}]], [["lambda_5", 0, 30, {}]], [["lambda_5", 0, 31, {}]], [["lambda_5", 0, 32, {}]], [["lambda_5", 0, 33, {}]], [["lambda_5", 0, 34, {}]], [["lambda_5", 0, 35, {}]], [["lambda_5", 0, 36, {}]], [["lambda_5", 0, 37, {}]], [["lambda_5", 0, 38, {}]], [["lambda_5", 0, 39, {}]], [["lambda_5", 0, 40, {}]], [["lambda_5", 0, 41, {}]], [["lambda_5", 0, 42, {}]], [["lambda_5", 0, 43, {}]], [["lambda_5", 0, 44, {}]], [["lambda_5", 0, 45, {}]], [["lambda_5", 0, 46, {}]], [["lambda_5", 0, 47, {}]], [["lambda_5", 0, 48, {}]], [["lambda_5", 0, 49, {}]], [["lambda_5", 0, 50, {}]], [["lambda_5", 0, 51, {}]], [["lambda_5", 0, 52, {}]], [["lambda_5", 0, 53, {}]], [["lambda_5", 0, 54, {}]], [["lambda_5", 0, 55, {}]], [["lambda_5", 0, 56, {}]], [["lambda_5", 0, 57, {}]], [["lambda_5", 0, 58, {}]], [["lambda_5", 0, 59, {}]], [["lambda_5", 0, 60, {}]], [["lambda_5", 0, 61, {}]], [["lambda_5", 0, 62, {}]], [["lambda_5", 0, 63, {}]], [["lambda_5", 0, 64, {}]], [["lambda_5", 0, 65, {}]], [["lambda_5", 0, 66, {}]], [["lambda_5", 0, 67, {}]], [["lambda_5", 0, 68, {}]], [["lambda_5", 0, 69, {}]], [["lambda_5", 0, 70, {}]], [["lambda_5", 0, 71, {}]], [["lambda_5", 0, 72, {}]], [["lambda_5", 0, 73, {}]], [["lambda_5", 0, 74, {}]], [["lambda_5", 0, 75, {}]], [["lambda_5", 0, 76, {}]], [["lambda_5", 0, 77, {}]], [["lambda_5", 0, 78, {}]], [["lambda_5", 0, 79, {}]], [["lambda_5", 0, 80, {}]], [["lambda_5", 0, 81, {}]], [["lambda_5", 0, 82, {}]], [["lambda_5", 0, 83, {}]], [["lambda_5", 0, 84, {}]], [["lambda_5", 0, 85, {}]], [["lambda_5", 0, 86, {}]], [["lambda_5", 0, 87, {}]], [["lambda_5", 0, 88, {}]], [["lambda_5", 0, 89, {}]], [["lambda_5", 0, 90, {}]], [["lambda_5", 0, 91, {}]], [["lambda_5", 0, 92, {}]], [["lambda_5", 0, 93, {}]], [["lambda_5", 0, 94, {}]], [["lambda_5", 0, 95, {}]], [["lambda_5", 0, 96, {}]], [["lambda_5", 0, 97, {}]], [["lambda_5", 0, 98, {}]], [["lambda_5", 0, 99, {}]], [["lambda_5", 0, 100, {}]], [["lambda_5", 0, 101, {}]], [["lambda_5", 0, 102, {}]], [["lambda_5", 0, 103, {}]], [["lambda_5", 0, 104, {}]], [["lambda_5", 0, 105, {}]], [["lambda_5", 0, 106, {}]], [["lambda_5", 0, 107, {}]], [["lambda_5", 0, 108, {}]], [["lambda_5", 0, 109, {}]], [["lambda_5", 0, 110, {}]], [["lambda_5", 0, 111, {}]], [["lambda_5", 0, 112, {}]], [["lambda_5", 0, 113, {}]], [["lambda_5", 0, 114, {}]], [["lambda_5", 0, 115, {}]], [["lambda_5", 0, 116, {}]], [["lambda_5", 0, 117, {}]], [["lambda_5", 0, 118, {}]], [["lambda_5", 0, 119, {}]], [["lambda_5", 0, 120, {}]], [["lambda_5", 0, 121, {}]], [["lambda_5", 0, 122, {}]], [["lambda_5", 0, 123, {}]], [["lambda_5", 0, 124, {}]], [["lambda_5", 0, 125, {}]], [["lambda_5", 0, 126, {}]], [["lambda_5", 0, 127, {}]], [["lambda_5", 0, 128, {}]], [["lambda_5", 0, 129, {}]], [["lambda_5", 0, 130, {}]], [["lambda_5", 0, 131, {}]], [["lambda_5", 0, 132, {}]], [["lambda_5", 0, 133, {}]], [["lambda_5", 0, 134, {}]], [["lambda_5", 0, 135, {}]], [["lambda_5", 0, 136, {}]], [["lambda_5", 0, 137, {}]], [["lambda_5", 0, 138, {}]], [["lambda_5", 0, 139, {}]], [["lambda_5", 0, 140, {}]], [["lambda_5", 0, 141, {}]], [["lambda_5", 0, 142, {}]], [["lambda_5", 0, 143, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": false, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwCpA07pAQAAAKkB2gRh\neGlzqQLaAnRm2gVzdGFja6kB2gF4qQByCgAAAPpMQzovVXNlcnMvYWxleGEvRG9jdW1lbnRzL1N0\ndWRpdW0vU3R1ZGl1bS9CYWNoZWxvcmFyYmVpdC9CQV9HQU4vbHN0bV9tb2RlbC5wedoIPGxhbWJk\nYT6OAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "lstm_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["emb_cid", 0, 0, {}], ["emb_cid", 1, 0, {}], ["emb_cid", 2, 0, {}], ["emb_cid", 3, 0, {}], ["emb_cid", 4, 0, {}], ["emb_cid", 5, 0, {}], ["emb_cid", 6, 0, {}], ["emb_cid", 7, 0, {}], ["emb_cid", 8, 0, {}], ["emb_cid", 9, 0, {}], ["emb_cid", 10, 0, {}], ["emb_cid", 11, 0, {}], ["emb_cid", 12, 0, {}], ["emb_cid", 13, 0, {}], ["emb_cid", 14, 0, {}], ["emb_cid", 15, 0, {}], ["emb_cid", 16, 0, {}], ["emb_cid", 17, 0, {}], ["emb_cid", 18, 0, {}], ["emb_cid", 19, 0, {}], ["emb_cid", 20, 0, {}], ["emb_cid", 21, 0, {}], ["emb_cid", 22, 0, {}], ["emb_cid", 23, 0, {}], ["emb_cid", 24, 0, {}], ["emb_cid", 25, 0, {}], ["emb_cid", 26, 0, {}], ["emb_cid", 27, 0, {}], ["emb_cid", 28, 0, {}], ["emb_cid", 29, 0, {}], ["emb_cid", 30, 0, {}], ["emb_cid", 31, 0, {}], ["emb_cid", 32, 0, {}], ["emb_cid", 33, 0, {}], ["emb_cid", 34, 0, {}], ["emb_cid", 35, 0, {}], ["emb_cid", 36, 0, {}], ["emb_cid", 37, 0, {}], ["emb_cid", 38, 0, {}], ["emb_cid", 39, 0, {}], ["emb_cid", 40, 0, {}], ["emb_cid", 41, 0, {}], ["emb_cid", 42, 0, {}], ["emb_cid", 43, 0, {}], ["emb_cid", 44, 0, {}], ["emb_cid", 45, 0, {}], ["emb_cid", 46, 0, {}], ["emb_cid", 47, 0, {}], ["emb_cid", 48, 0, {}], ["emb_cid", 49, 0, {}], ["emb_cid", 50, 0, {}], ["emb_cid", 51, 0, {}], ["emb_cid", 52, 0, {}], ["emb_cid", 53, 0, {}], ["emb_cid", 54, 0, {}], ["emb_cid", 55, 0, {}], ["emb_cid", 56, 0, {}], ["emb_cid", 57, 0, {}], ["emb_cid", 58, 0, {}], ["emb_cid", 59, 0, {}], ["emb_cid", 60, 0, {}], ["emb_cid", 61, 0, {}], ["emb_cid", 62, 0, {}], ["emb_cid", 63, 0, {}], ["emb_cid", 64, 0, {}], ["emb_cid", 65, 0, {}], ["emb_cid", 66, 0, {}], ["emb_cid", 67, 0, {}], ["emb_cid", 68, 0, {}], ["emb_cid", 69, 0, {}], ["emb_cid", 70, 0, {}], ["emb_cid", 71, 0, {}], ["emb_cid", 72, 0, {}], ["emb_cid", 73, 0, {}], ["emb_cid", 74, 0, {}], ["emb_cid", 75, 0, {}], ["emb_cid", 76, 0, {}], ["emb_cid", 77, 0, {}], ["emb_cid", 78, 0, {}], ["emb_cid", 79, 0, {}], ["emb_cid", 80, 0, {}], ["emb_cid", 81, 0, {}], ["emb_cid", 82, 0, {}], ["emb_cid", 83, 0, {}], ["emb_cid", 84, 0, {}], ["emb_cid", 85, 0, {}], ["emb_cid", 86, 0, {}], ["emb_cid", 87, 0, {}], ["emb_cid", 88, 0, {}], ["emb_cid", 89, 0, {}], ["emb_cid", 90, 0, {}], ["emb_cid", 91, 0, {}], ["emb_cid", 92, 0, {}], ["emb_cid", 93, 0, {}], ["emb_cid", 94, 0, {}], ["emb_cid", 95, 0, {}], ["emb_cid", 96, 0, {}], ["emb_cid", 97, 0, {}], ["emb_cid", 98, 0, {}], ["emb_cid", 99, 0, {}], ["emb_cid", 100, 0, {}], ["emb_cid", 101, 0, {}], ["emb_cid", 102, 0, {}], ["emb_cid", 103, 0, {}], ["emb_cid", 104, 0, {}], ["emb_cid", 105, 0, {}], ["emb_cid", 106, 0, {}], ["emb_cid", 107, 0, {}], ["emb_cid", 108, 0, {}], ["emb_cid", 109, 0, {}], ["emb_cid", 110, 0, {}], ["emb_cid", 111, 0, {}], ["emb_cid", 112, 0, {}], ["emb_cid", 113, 0, {}], ["emb_cid", 114, 0, {}], ["emb_cid", 115, 0, {}], ["emb_cid", 116, 0, {}], ["emb_cid", 117, 0, {}], ["emb_cid", 118, 0, {}], ["emb_cid", 119, 0, {}], ["emb_cid", 120, 0, {}], ["emb_cid", 121, 0, {}], ["emb_cid", 122, 0, {}], ["emb_cid", 123, 0, {}], ["emb_cid", 124, 0, {}], ["emb_cid", 125, 0, {}], ["emb_cid", 126, 0, {}], ["emb_cid", 127, 0, {}], ["emb_cid", 128, 0, {}], ["emb_cid", 129, 0, {}], ["emb_cid", 130, 0, {}], ["emb_cid", 131, 0, {}], ["emb_cid", 132, 0, {}], ["emb_cid", 133, 0, {}], ["emb_cid", 134, 0, {}], ["emb_cid", 135, 0, {}], ["emb_cid", 136, 0, {}], ["emb_cid", 137, 0, {}], ["emb_cid", 138, 0, {}], ["emb_cid", 139, 0, {}], ["emb_cid", 140, 0, {}], ["emb_cid", 141, 0, {}], ["emb_cid", 142, 0, {}], ["emb_cid", 143, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_145", "trainable": false, "dtype": "float32", "axis": 2}, "name": "concatenate_145", "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": false, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwCpA07pAQAAAKkB2gRh\neGlzqQLaAnRm2gd1bnN0YWNrqQHaAXipAHIKAAAA+kxDOi9Vc2Vycy9hbGV4YS9Eb2N1bWVudHMv\nU3R1ZGl1bS9TdHVkaXVtL0JhY2hlbG9yYXJiZWl0L0JBX0dBTi9sc3RtX21vZGVsLnB52gg8bGFt\nYmRhPpwAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "lstm_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["concatenate_145", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "emb_trajpoint", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": 1}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "emb_trajpoint", "inbound_nodes": [[["lambda_7", 0, 0, {}]], [["lambda_7", 0, 1, {}]], [["lambda_7", 0, 2, {}]], [["lambda_7", 0, 3, {}]], [["lambda_7", 0, 4, {}]], [["lambda_7", 0, 5, {}]], [["lambda_7", 0, 6, {}]], [["lambda_7", 0, 7, {}]], [["lambda_7", 0, 8, {}]], [["lambda_7", 0, 9, {}]], [["lambda_7", 0, 10, {}]], [["lambda_7", 0, 11, {}]], [["lambda_7", 0, 12, {}]], [["lambda_7", 0, 13, {}]], [["lambda_7", 0, 14, {}]], [["lambda_7", 0, 15, {}]], [["lambda_7", 0, 16, {}]], [["lambda_7", 0, 17, {}]], [["lambda_7", 0, 18, {}]], [["lambda_7", 0, 19, {}]], [["lambda_7", 0, 20, {}]], [["lambda_7", 0, 21, {}]], [["lambda_7", 0, 22, {}]], [["lambda_7", 0, 23, {}]], [["lambda_7", 0, 24, {}]], [["lambda_7", 0, 25, {}]], [["lambda_7", 0, 26, {}]], [["lambda_7", 0, 27, {}]], [["lambda_7", 0, 28, {}]], [["lambda_7", 0, 29, {}]], [["lambda_7", 0, 30, {}]], [["lambda_7", 0, 31, {}]], [["lambda_7", 0, 32, {}]], [["lambda_7", 0, 33, {}]], [["lambda_7", 0, 34, {}]], [["lambda_7", 0, 35, {}]], [["lambda_7", 0, 36, {}]], [["lambda_7", 0, 37, {}]], [["lambda_7", 0, 38, {}]], [["lambda_7", 0, 39, {}]], [["lambda_7", 0, 40, {}]], [["lambda_7", 0, 41, {}]], [["lambda_7", 0, 42, {}]], [["lambda_7", 0, 43, {}]], [["lambda_7", 0, 44, {}]], [["lambda_7", 0, 45, {}]], [["lambda_7", 0, 46, {}]], [["lambda_7", 0, 47, {}]], [["lambda_7", 0, 48, {}]], [["lambda_7", 0, 49, {}]], [["lambda_7", 0, 50, {}]], [["lambda_7", 0, 51, {}]], [["lambda_7", 0, 52, {}]], [["lambda_7", 0, 53, {}]], [["lambda_7", 0, 54, {}]], [["lambda_7", 0, 55, {}]], [["lambda_7", 0, 56, {}]], [["lambda_7", 0, 57, {}]], [["lambda_7", 0, 58, {}]], [["lambda_7", 0, 59, {}]], [["lambda_7", 0, 60, {}]], [["lambda_7", 0, 61, {}]], [["lambda_7", 0, 62, {}]], [["lambda_7", 0, 63, {}]], [["lambda_7", 0, 64, {}]], [["lambda_7", 0, 65, {}]], [["lambda_7", 0, 66, {}]], [["lambda_7", 0, 67, {}]], [["lambda_7", 0, 68, {}]], [["lambda_7", 0, 69, {}]], [["lambda_7", 0, 70, {}]], [["lambda_7", 0, 71, {}]], [["lambda_7", 0, 72, {}]], [["lambda_7", 0, 73, {}]], [["lambda_7", 0, 74, {}]], [["lambda_7", 0, 75, {}]], [["lambda_7", 0, 76, {}]], [["lambda_7", 0, 77, {}]], [["lambda_7", 0, 78, {}]], [["lambda_7", 0, 79, {}]], [["lambda_7", 0, 80, {}]], [["lambda_7", 0, 81, {}]], [["lambda_7", 0, 82, {}]], [["lambda_7", 0, 83, {}]], [["lambda_7", 0, 84, {}]], [["lambda_7", 0, 85, {}]], [["lambda_7", 0, 86, {}]], [["lambda_7", 0, 87, {}]], [["lambda_7", 0, 88, {}]], [["lambda_7", 0, 89, {}]], [["lambda_7", 0, 90, {}]], [["lambda_7", 0, 91, {}]], [["lambda_7", 0, 92, {}]], [["lambda_7", 0, 93, {}]], [["lambda_7", 0, 94, {}]], [["lambda_7", 0, 95, {}]], [["lambda_7", 0, 96, {}]], [["lambda_7", 0, 97, {}]], [["lambda_7", 0, 98, {}]], [["lambda_7", 0, 99, {}]], [["lambda_7", 0, 100, {}]], [["lambda_7", 0, 101, {}]], [["lambda_7", 0, 102, {}]], [["lambda_7", 0, 103, {}]], [["lambda_7", 0, 104, {}]], [["lambda_7", 0, 105, {}]], [["lambda_7", 0, 106, {}]], [["lambda_7", 0, 107, {}]], [["lambda_7", 0, 108, {}]], [["lambda_7", 0, 109, {}]], [["lambda_7", 0, 110, {}]], [["lambda_7", 0, 111, {}]], [["lambda_7", 0, 112, {}]], [["lambda_7", 0, 113, {}]], [["lambda_7", 0, 114, {}]], [["lambda_7", 0, 115, {}]], [["lambda_7", 0, 116, {}]], [["lambda_7", 0, 117, {}]], [["lambda_7", 0, 118, {}]], [["lambda_7", 0, 119, {}]], [["lambda_7", 0, 120, {}]], [["lambda_7", 0, 121, {}]], [["lambda_7", 0, 122, {}]], [["lambda_7", 0, 123, {}]], [["lambda_7", 0, 124, {}]], [["lambda_7", 0, 125, {}]], [["lambda_7", 0, 126, {}]], [["lambda_7", 0, 127, {}]], [["lambda_7", 0, 128, {}]], [["lambda_7", 0, 129, {}]], [["lambda_7", 0, 130, {}]], [["lambda_7", 0, 131, {}]], [["lambda_7", 0, 132, {}]], [["lambda_7", 0, 133, {}]], [["lambda_7", 0, 134, {}]], [["lambda_7", 0, 135, {}]], [["lambda_7", 0, 136, {}]], [["lambda_7", 0, 137, {}]], [["lambda_7", 0, 138, {}]], [["lambda_7", 0, 139, {}]], [["lambda_7", 0, 140, {}]], [["lambda_7", 0, 141, {}]], [["lambda_7", 0, 142, {}]], [["lambda_7", 0, 143, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": false, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMOAAAAdABqAXwAZAFkAo0CUwCpA07pAQAAAKkB2gRh\neGlzqQLaAnRm2gVzdGFja6kB2gF4qQByCgAAAPpMQzovVXNlcnMvYWxleGEvRG9jdW1lbnRzL1N0\ndWRpdW0vU3R1ZGl1bS9CYWNoZWxvcmFyYmVpdC9CQV9HQU4vbHN0bV9tb2RlbC5wedoIPGxhbWJk\nYT6hAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "lstm_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["emb_trajpoint", 0, 0, {}], ["emb_trajpoint", 1, 0, {}], ["emb_trajpoint", 2, 0, {}], ["emb_trajpoint", 3, 0, {}], ["emb_trajpoint", 4, 0, {}], ["emb_trajpoint", 5, 0, {}], ["emb_trajpoint", 6, 0, {}], ["emb_trajpoint", 7, 0, {}], ["emb_trajpoint", 8, 0, {}], ["emb_trajpoint", 9, 0, {}], ["emb_trajpoint", 10, 0, {}], ["emb_trajpoint", 11, 0, {}], ["emb_trajpoint", 12, 0, {}], ["emb_trajpoint", 13, 0, {}], ["emb_trajpoint", 14, 0, {}], ["emb_trajpoint", 15, 0, {}], ["emb_trajpoint", 16, 0, {}], ["emb_trajpoint", 17, 0, {}], ["emb_trajpoint", 18, 0, {}], ["emb_trajpoint", 19, 0, {}], ["emb_trajpoint", 20, 0, {}], ["emb_trajpoint", 21, 0, {}], ["emb_trajpoint", 22, 0, {}], ["emb_trajpoint", 23, 0, {}], ["emb_trajpoint", 24, 0, {}], ["emb_trajpoint", 25, 0, {}], ["emb_trajpoint", 26, 0, {}], ["emb_trajpoint", 27, 0, {}], ["emb_trajpoint", 28, 0, {}], ["emb_trajpoint", 29, 0, {}], ["emb_trajpoint", 30, 0, {}], ["emb_trajpoint", 31, 0, {}], ["emb_trajpoint", 32, 0, {}], ["emb_trajpoint", 33, 0, {}], ["emb_trajpoint", 34, 0, {}], ["emb_trajpoint", 35, 0, {}], ["emb_trajpoint", 36, 0, {}], ["emb_trajpoint", 37, 0, {}], ["emb_trajpoint", 38, 0, {}], ["emb_trajpoint", 39, 0, {}], ["emb_trajpoint", 40, 0, {}], ["emb_trajpoint", 41, 0, {}], ["emb_trajpoint", 42, 0, {}], ["emb_trajpoint", 43, 0, {}], ["emb_trajpoint", 44, 0, {}], ["emb_trajpoint", 45, 0, {}], ["emb_trajpoint", 46, 0, {}], ["emb_trajpoint", 47, 0, {}], ["emb_trajpoint", 48, 0, {}], ["emb_trajpoint", 49, 0, {}], ["emb_trajpoint", 50, 0, {}], ["emb_trajpoint", 51, 0, {}], ["emb_trajpoint", 52, 0, {}], ["emb_trajpoint", 53, 0, {}], ["emb_trajpoint", 54, 0, {}], ["emb_trajpoint", 55, 0, {}], ["emb_trajpoint", 56, 0, {}], ["emb_trajpoint", 57, 0, {}], ["emb_trajpoint", 58, 0, {}], ["emb_trajpoint", 59, 0, {}], ["emb_trajpoint", 60, 0, {}], ["emb_trajpoint", 61, 0, {}], ["emb_trajpoint", 62, 0, {}], ["emb_trajpoint", 63, 0, {}], ["emb_trajpoint", 64, 0, {}], ["emb_trajpoint", 65, 0, {}], ["emb_trajpoint", 66, 0, {}], ["emb_trajpoint", 67, 0, {}], ["emb_trajpoint", 68, 0, {}], ["emb_trajpoint", 69, 0, {}], ["emb_trajpoint", 70, 0, {}], ["emb_trajpoint", 71, 0, {}], ["emb_trajpoint", 72, 0, {}], ["emb_trajpoint", 73, 0, {}], ["emb_trajpoint", 74, 0, {}], ["emb_trajpoint", 75, 0, {}], ["emb_trajpoint", 76, 0, {}], ["emb_trajpoint", 77, 0, {}], ["emb_trajpoint", 78, 0, {}], ["emb_trajpoint", 79, 0, {}], ["emb_trajpoint", 80, 0, {}], ["emb_trajpoint", 81, 0, {}], ["emb_trajpoint", 82, 0, {}], ["emb_trajpoint", 83, 0, {}], ["emb_trajpoint", 84, 0, {}], ["emb_trajpoint", 85, 0, {}], ["emb_trajpoint", 86, 0, {}], ["emb_trajpoint", 87, 0, {}], ["emb_trajpoint", 88, 0, {}], ["emb_trajpoint", 89, 0, {}], ["emb_trajpoint", 90, 0, {}], ["emb_trajpoint", 91, 0, {}], ["emb_trajpoint", 92, 0, {}], ["emb_trajpoint", 93, 0, {}], ["emb_trajpoint", 94, 0, {}], ["emb_trajpoint", 95, 0, {}], ["emb_trajpoint", 96, 0, {}], ["emb_trajpoint", 97, 0, {}], ["emb_trajpoint", 98, 0, {}], ["emb_trajpoint", 99, 0, {}], ["emb_trajpoint", 100, 0, {}], ["emb_trajpoint", 101, 0, {}], ["emb_trajpoint", 102, 0, {}], ["emb_trajpoint", 103, 0, {}], ["emb_trajpoint", 104, 0, {}], ["emb_trajpoint", 105, 0, {}], ["emb_trajpoint", 106, 0, {}], ["emb_trajpoint", 107, 0, {}], ["emb_trajpoint", 108, 0, {}], ["emb_trajpoint", 109, 0, {}], ["emb_trajpoint", 110, 0, {}], ["emb_trajpoint", 111, 0, {}], ["emb_trajpoint", 112, 0, {}], ["emb_trajpoint", 113, 0, {}], ["emb_trajpoint", 114, 0, {}], ["emb_trajpoint", 115, 0, {}], ["emb_trajpoint", 116, 0, {}], ["emb_trajpoint", 117, 0, {}], ["emb_trajpoint", 118, 0, {}], ["emb_trajpoint", 119, 0, {}], ["emb_trajpoint", 120, 0, {}], ["emb_trajpoint", 121, 0, {}], ["emb_trajpoint", 122, 0, {}], ["emb_trajpoint", 123, 0, {}], ["emb_trajpoint", 124, 0, {}], ["emb_trajpoint", 125, 0, {}], ["emb_trajpoint", 126, 0, {}], ["emb_trajpoint", 127, 0, {}], ["emb_trajpoint", 128, 0, {}], ["emb_trajpoint", 129, 0, {}], ["emb_trajpoint", 130, 0, {}], ["emb_trajpoint", 131, 0, {}], ["emb_trajpoint", 132, 0, {}], ["emb_trajpoint", 133, 0, {}], ["emb_trajpoint", 134, 0, {}], ["emb_trajpoint", 135, 0, {}], ["emb_trajpoint", 136, 0, {}], ["emb_trajpoint", 137, 0, {}], ["emb_trajpoint", 138, 0, {}], ["emb_trajpoint", 139, 0, {}], ["emb_trajpoint", 140, 0, {}], ["emb_trajpoint", 141, 0, {}], ["emb_trajpoint", 142, 0, {}], ["emb_trajpoint", 143, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": false, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 12}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 13}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 14}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": {"class_name": "L1", "config": {"l1": 0.019999999552965164}, "shared_object_id": 15}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_1", "inbound_nodes": [[["lambda_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": false, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}], "input_layers": [["input_cid", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.5.0", "backend": "tensorflow"}